; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 2191)
	(= (fuel plane1) 671)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city4)
	(= (capacity plane2) 9055)
	(= (fuel plane2) 1850)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city2)
	(= (capacity plane3) 12222)
	(= (fuel plane3) 55)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 15)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 10)
	(at person1 city0)
	(at person2 city1)
	(at person3 city7)
	(at person4 city4)
	(at person5 city0)
	(at person6 city6)
	(at person7 city7)
	(at person8 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 693)
	(= (distance city0 city2) 818)
	(= (distance city0 city3) 517)
	(= (distance city0 city4) 604)
	(= (distance city0 city5) 821)
	(= (distance city0 city6) 837)
	(= (distance city0 city7) 566)
	(= (distance city1 city0) 693)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 647)
	(= (distance city1 city3) 899)
	(= (distance city1 city4) 549)
	(= (distance city1 city5) 938)
	(= (distance city1 city6) 504)
	(= (distance city1 city7) 995)
	(= (distance city2 city0) 818)
	(= (distance city2 city1) 647)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 715)
	(= (distance city2 city4) 577)
	(= (distance city2 city5) 791)
	(= (distance city2 city6) 944)
	(= (distance city2 city7) 662)
	(= (distance city3 city0) 517)
	(= (distance city3 city1) 899)
	(= (distance city3 city2) 715)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 502)
	(= (distance city3 city5) 742)
	(= (distance city3 city6) 946)
	(= (distance city3 city7) 828)
	(= (distance city4 city0) 604)
	(= (distance city4 city1) 549)
	(= (distance city4 city2) 577)
	(= (distance city4 city3) 502)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 955)
	(= (distance city4 city6) 531)
	(= (distance city4 city7) 741)
	(= (distance city5 city0) 821)
	(= (distance city5 city1) 938)
	(= (distance city5 city2) 791)
	(= (distance city5 city3) 742)
	(= (distance city5 city4) 955)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 971)
	(= (distance city5 city7) 779)
	(= (distance city6 city0) 837)
	(= (distance city6 city1) 504)
	(= (distance city6 city2) 944)
	(= (distance city6 city3) 946)
	(= (distance city6 city4) 531)
	(= (distance city6 city5) 971)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 850)
	(= (distance city7 city0) 566)
	(= (distance city7 city1) 995)
	(= (distance city7 city2) 662)
	(= (distance city7 city3) 828)
	(= (distance city7 city4) 741)
	(= (distance city7 city5) 779)
	(= (distance city7 city6) 850)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city4)
	(at person3 city0)
	(at person4 city5)
	(at person5 city2)
	(at person6 city4)
	(at person7 city5)
	(at person8 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane2 city4)
   changed: (fuel plane2) from 1850 to 9055
   goals met: 0 of 8
2. (board person4 plane2 city4)
   deleted: (at person4 city4)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 8
3. (board person6 plane1 city6)
   deleted: (at person6 city6)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 8
4. (board person8 plane1 city6)
   deleted: (at person8 city6)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 8
5. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 0 to 531, (fuel plane1) from 671 to 140
   goals met: 0 of 8
6. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 8
7. (debark person8 plane1 city4)
   deleted: (in person8 plane1)
   added: (at person8 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 8
8. (fly plane2 city4 city1)
   deleted: (at plane2 city4)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 531 to 2178, (fuel plane2) from 9055 to 7408
   goals met: 2 of 8
9. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 8
10. (fly plane2 city1 city4)
   deleted: (at plane2 city1)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 2178 to 3825, (fuel plane2) from 7408 to 5761
   goals met: 2 of 8
11. (debark person2 plane2 city4)
   deleted: (in person2 plane2)
   added: (at person2 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 3 of 8
12. (fly plane2 city4 city0)
   deleted: (at plane2 city4)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 3825 to 5637, (fuel plane2) from 5761 to 3949
   goals met: 3 of 8
13. (board person1 plane2 city0)
   deleted: (at person1 city0)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 3 of 8
14. (board person5 plane2 city0)
   deleted: (at person5 city0)
   added: (in person5 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 3 of 8
15. (fly plane2 city0 city7)
   deleted: (at plane2 city0)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 5637 to 7335, (fuel plane2) from 3949 to 2251
   goals met: 3 of 8
16. (board person3 plane2 city7)
   deleted: (at person3 city7)
   added: (in person3 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 3 of 8
17. (board person7 plane2 city7)
   deleted: (at person7 city7)
   added: (in person7 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 3 of 8
18. (fly plane2 city7 city0)
   deleted: (at plane2 city7)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 7335 to 9033, (fuel plane2) from 2251 to 553
   goals met: 3 of 8
19. (debark person3 plane2 city0)
   deleted: (in person3 plane2)
   added: (at person3 city0)
   changed: (onboard plane2) from 5 to 4
   goals met: 4 of 8
20. (refuel plane2 city0)
   changed: (fuel plane2) from 553 to 9055
   goals met: 4 of 8
21. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 9033 to 11112, (fuel plane2) from 9055 to 6976
   goals met: 4 of 8
22. (debark person1 plane2 city1)
   deleted: (in person1 plane2)
   added: (at person1 city1)
   changed: (onboard plane2) from 4 to 3
   goals met: 5 of 8
23. (fly plane2 city1 city5)
   deleted: (at plane2 city1)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 11112 to 13926, (fuel plane2) from 6976 to 4162
   goals met: 5 of 8
24. (debark person4 plane2 city5)
   deleted: (in person4 plane2)
   added: (at person4 city5)
   changed: (onboard plane2) from 3 to 2
   goals met: 6 of 8
25. (debark person7 plane2 city5)
   deleted: (in person7 plane2)
   added: (at person7 city5)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 8
26. (fly plane2 city5 city2)
   deleted: (at plane2 city5)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 13926 to 16299, (fuel plane2) from 4162 to 1789
   goals met: 7 of 8
27. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 8
